system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default          Gauss linear;
    div(tauMC)       Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{

    default             midPoint;
    reconstruct(p)      Minmod;
    reconstruct(M)      Minmod;
    reconstruct(T)      Minmod;
    reconstruct(rho)    Minmod;
    reconstruct(U)      Minmod;
    reconstruct(rhoU)   midPoint;


/*
    //default         linear;
    //reconstruct(rho) vanLeer;
    //reconstruct(U)  vanLeerV;
    //reconstruct(T)  vanLeer;
    default          midPoint;
    reconstruct(rho) Minmod;
    reconstruct(U)   MinmodV;
    reconstruct(T)   Minmod;
*/
    }

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method 		meshWave;

    correctWalls	true;
}
// ************************************************************************* //
