system/probe
type		probes;
libs		(sampling);
name 		probes;
writeControl	outputTime;
writeInterval	1;
fields		(p);

probeLocations
	(
		(0.20133   -0.007610    0.435987)
		(0.397374  -0.00811415  0.446485)
		(0.801636  -0.00759864  0.435326)
	);
